# ViewSection Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSection Class
Members See Also
---
ViewSection covers sections, details, elevations, and callouts, all in their reference and non-reference variations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class ViewSection : View
```

Visual Basic
---
```text
Public Class ViewSection _
	Inherits View
```

Visual C++
---
```text
public ref class ViewSection : public View
```

# Remarks
The creation functions for elevations can be found in the ElevationMarker class.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..View Autodesk.Revit.DB..::..ViewSection
# See Also
ViewSection Members
Autodesk.Revit.DB Namespace